jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/usbhs.h
/* -------- USBHS_TXHUBADDREP : (USBHS Offset: 0x02) (R/W 8) Relevant In Host Mode Only. HUB Address -------- */
#define USBHS_TXHUBADDREP_RESETVALUE          _UINT8_(0x00)                                        /*  (USBHS_TXHUBADDREP) Relevant In Host Mode Only. HUB Address  Reset Value */

#define USBHS_TXHUBADDREP_TXHUBADDR_Pos       _UINT8_(0)                                           /* (USBHS_TXHUBADDREP) hub address Position */
#define USBHS_TXHUBADDREP_TXHUBADDR_Msk       (_UINT8_(0x7F) << USBHS_TXHUBADDREP_TXHUBADDR_Pos)   /* (USBHS_TXHUBADDREP) hub address Mask */
#define USBHS_TXHUBADDREP_TXHUBADDR(value)    (USBHS_TXHUBADDREP_TXHUBADDR_Msk & (_UINT8_(value) << USBHS_TXHUBADDREP_TXHUBADDR_Pos)) /* Assigment of value for TXHUBADDR in the USBHS_TXHUBADDREP register */
#define USBHS_TXHUBADDREP_MULTRANS_Pos        _UINT8_(7)                                           /* (USBHS_TXHUBADDREP) hub has multiple or single translator Position */
#define USBHS_TXHUBADDREP_MULTRANS_Msk        (_UINT8_(0x1) << USBHS_TXHUBADDREP_MULTRANS_Pos)     /* (USBHS_TXHUBADDREP) hub has multiple or single translator Mask */
#define USBHS_TXHUBADDREP_MULTRANS(value)     (USBHS_TXHUBADDREP_MULTRANS_Msk & (_UINT8_(value) << USBHS_TXHUBADDREP_MULTRANS_Pos)) /* Assigment of value for MULTRANS in the USBHS_TXHUBADDREP register */
#define USBHS_TXHUBADDREP_Msk                 _UINT8_(0xFF)                                        /* (USBHS_TXHUBADDREP) Register Mask  */


/* -------- USBHS_TXHUBPORT : (USBHS Offset: 0x03) (R/W 8) Relevant In Host Mode Only. HUB Address -------- */
#define USBHS_TXHUBPORT_RESETVALUE            _UINT8_(0x00)                                        /*  (USBHS_TXHUBPORT) Relevant In Host Mode Only. HUB Address  Reset Value */

#define USBHS_TXHUBPORT_HUBPORT_Pos           _UINT8_(0)                                           /* (USBHS_TXHUBPORT) Hub Port Position */
#define USBHS_TXHUBPORT_HUBPORT_Msk           (_UINT8_(0x7F) << USBHS_TXHUBPORT_HUBPORT_Pos)       /* (USBHS_TXHUBPORT) Hub Port Mask */
#define USBHS_TXHUBPORT_HUBPORT(value)        (USBHS_TXHUBPORT_HUBPORT_Msk & (_UINT8_(value) << USBHS_TXHUBPORT_HUBPORT_Pos)) /* Assigment of value for HUBPORT in the USBHS_TXHUBPORT register */
#define USBHS_TXHUBPORT_Msk                   _UINT8_(0x7F)                                        /* (USBHS_TXHUBPORT) Register Mask  */


/* -------- USBHS_RXFUNCADDREP : (USBHS Offset: 0x04) (R/W 8) Relevant In Host Mode Only. Address Of The Target Function. -------- */
#define USBHS_RXFUNCADDREP_RESETVALUE         _UINT8_(0x00)                                        /*  (USBHS_RXFUNCADDREP) Relevant In Host Mode Only. Address Of The Target Function.  Reset Value */

#define USBHS_RXFUNCADDREP_RXFUNCADDR_Pos     _UINT8_(0)                                           /* (USBHS_RXFUNCADDREP) address of the target function Position */
#define USBHS_RXFUNCADDREP_RXFUNCADDR_Msk     (_UINT8_(0x7F) << USBHS_RXFUNCADDREP_RXFUNCADDR_Pos) /* (USBHS_RXFUNCADDREP) address of the target function Mask */
#define USBHS_RXFUNCADDREP_RXFUNCADDR(value)  (USBHS_RXFUNCADDREP_RXFUNCADDR_Msk & (_UINT8_(value) << USBHS_RXFUNCADDREP_RXFUNCADDR_Pos)) /* Assigment of value for RXFUNCADDR in the USBHS_RXFUNCADDREP register */
#define USBHS_RXFUNCADDREP_Msk                _UINT8_(0x7F)                                        /* (USBHS_RXFUNCADDREP) Register Mask  */


/* -------- USBHS_RXHUBADDREP : (USBHS Offset: 0x06) (R/W 8) Relevant In Host Mode Only. HUB Address -------- */
#define USBHS_RXHUBADDREP_RESETVALUE          _UINT8_(0x00)                                        /*  (USBHS_RXHUBADDREP) Relevant In Host Mode Only. HUB Address  Reset Value */

#define USBHS_RXHUBADDREP_RXHUBADDR_Pos       _UINT8_(0)                                           /* (USBHS_RXHUBADDREP) hub address Position */
#define USBHS_RXHUBADDREP_RXHUBADDR_Msk       (_UINT8_(0x7F) << USBHS_RXHUBADDREP_RXHUBADDR_Pos)   /* (USBHS_RXHUBADDREP) hub address Mask */
#define USBHS_RXHUBADDREP_RXHUBADDR(value)    (USBHS_RXHUBADDREP_RXHUBADDR_Msk & (_UINT8_(value) << USBHS_RXHUBADDREP_RXHUBADDR_Pos)) /* Assigment of value for RXHUBADDR in the USBHS_RXHUBADDREP register */
#define USBHS_RXHUBADDREP_MULTRANS_Pos        _UINT8_(7)                                           /* (USBHS_RXHUBADDREP) hub has multiple or single translator Position */
#define USBHS_RXHUBADDREP_MULTRANS_Msk        (_UINT8_(0x1) << USBHS_RXHUBADDREP_MULTRANS_Pos)     /* (USBHS_RXHUBADDREP) hub has multiple or single translator Mask */
#define USBHS_RXHUBADDREP_MULTRANS(value)     (USBHS_RXHUBADDREP_MULTRANS_Msk & (_UINT8_(value) << USBHS_RXHUBADDREP_MULTRANS_Pos)) /* Assigment of value for MULTRANS in the USBHS_RXHUBADDREP register */
#define USBHS_RXHUBADDREP_Msk                 _UINT8_(0xFF)                                        /* (USBHS_RXHUBADDREP) Register Mask  */


/* -------- USBHS_RXHUBPORT : (USBHS Offset: 0x07) (R/W 8) Relevant In Host Mode Only. HUB Address -------- */
#define USBHS_RXHUBPORT_RESETVALUE            _UINT8_(0x00)                                        /*  (USBHS_RXHUBPORT) Relevant In Host Mode Only. HUB Address  Reset Value */

#define USBHS_RXHUBPORT_HUBPORT_Pos           _UINT8_(0)                                           /* (USBHS_RXHUBPORT) Hub Port Position */
#define USBHS_RXHUBPORT_HUBPORT_Msk           (_UINT8_(0x7F) << USBHS_RXHUBPORT_HUBPORT_Pos)       /* (USBHS_RXHUBPORT) Hub Port Mask */
#define USBHS_RXHUBPORT_HUBPORT(value)        (USBHS_RXHUBPORT_HUBPORT_Msk & (_UINT8_(value) << USBHS_RXHUBPORT_HUBPORT_Pos)) /* Assigment of value for HUBPORT in the USBHS_RXHUBPORT register */
#define USBHS_RXHUBPORT_Msk                   _UINT8_(0x7F)                                        /* (USBHS_RXHUBPORT) Register Mask  */


/* -------- USBHS_CTRLA : (USBHS Offset: 0x00) (R/W 32) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected) -------- */
#define USBHS_CTRLA_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_CTRLA) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected)  Reset Value */

