jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/usbhs.h
/* -------- USBHS_ENDPOINTX_RXTYPE : (USBHS Offset: 0x101C) (R/W 8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint -------- */
#define USBHS_ENDPOINTX_RXTYPE_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint  Reset Value */

#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration. Position */
#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos) /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this value to the endpoint number contained in the rx endpoint descriptor returned to the musbmhdrc during device enumeration. Mask */
#define USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER(value) (USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_ENDPOINTNUMBER_Pos)) /* Assigment of value for ENDPOINTNUMBER in the USBHS_ENDPOINTX_RXTYPE register */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos   _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Position */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Msk   (_UINT8_(0x3) << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE) the cpu should set this to select the required protocol for the rx endpoint 00: control 01: isochronous 10: bulk 11: interrupt Mask */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL(value) (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos)) /* Assigment of value for PROTOCOL in the USBHS_ENDPOINTX_RXTYPE register */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_CONTROL_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_ISOCHRONOUS_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK  (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_BULK_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT (USBHS_ENDPOINTX_RXTYPE_PROTOCOL_INTERRUPT_Val << USBHS_ENDPOINTX_RXTYPE_PROTOCOL_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_Pos      _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Position */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_Msk      (_UINT8_(0x3) << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos)   /* (USBHS_ENDPOINTX_RXTYPE) operating speed of the target device when the core is configured with the multipoint option: 00: unused (note: if selected, the target will be assumed to be using the same connection speed as the core.) 01: high 10: full 11: low Mask */
#define USBHS_ENDPOINTX_RXTYPE_SPEED(value)   (USBHS_ENDPOINTX_RXTYPE_SPEED_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_ENDPOINTX_RXTYPE register */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED_Val _UINT8_(0x0)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH_Val _UINT8_(0x1)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_FULL_Val _UINT8_(0x2)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define   USBHS_ENDPOINTX_RXTYPE_SPEED_LOW_Val _UINT8_(0x3)                                         /* (USBHS_ENDPOINTX_RXTYPE)   */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED   (USBHS_ENDPOINTX_RXTYPE_SPEED_UNUSED_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH     (USBHS_ENDPOINTX_RXTYPE_SPEED_HIGH_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_FULL     (USBHS_ENDPOINTX_RXTYPE_SPEED_FULL_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_SPEED_LOW      (USBHS_ENDPOINTX_RXTYPE_SPEED_LOW_Val << USBHS_ENDPOINTX_RXTYPE_SPEED_Pos) /* (USBHS_ENDPOINTX_RXTYPE)  Position  */
#define USBHS_ENDPOINTX_RXTYPE_Msk            _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_RXTYPE) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXINTERVAL : (USBHS Offset: 0x101D) (R/W 8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint. -------- */
#define USBHS_ENDPOINTX_RXINTERVAL_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint.  Reset Value */

#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXINTERVAL) polling interval Position */
#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Msk (_UINT8_(0xFF) << USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos) /* (USBHS_ENDPOINTX_RXINTERVAL) polling interval Mask */
#define USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL(value) (USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXINTERVAL_RXPOLLINGINTERVAL_Pos)) /* Assigment of value for RXPOLLINGINTERVAL in the USBHS_ENDPOINTX_RXINTERVAL register */
#define USBHS_ENDPOINTX_RXINTERVAL_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_RXINTERVAL) Register Mask  */


/* -------- USBHS_ENDPOINTX_FIFOSIZE : (USBHS Offset: 0x101F) ( R/ 8) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15 -------- */
#define USBHS_ENDPOINTX_FIFOSIZE_RESETVALUE   _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_FIFOSIZE) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15  Reset Value */

#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_FIFOSIZE) Tx FIFO Size Position */
#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos) /* (USBHS_ENDPOINTX_FIFOSIZE) Tx FIFO Size Mask */
#define USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE(value) (USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_FIFOSIZE_TXFIFOSIZE_Pos)) /* Assigment of value for TXFIFOSIZE in the USBHS_ENDPOINTX_FIFOSIZE register */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_FIFOSIZE) Rx FIFO Size Position */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Msk (_UINT8_(0xF) << USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos) /* (USBHS_ENDPOINTX_FIFOSIZE) Rx FIFO Size Mask */
#define USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE(value) (USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_FIFOSIZE_RXFIFOSIZE_Pos)) /* Assigment of value for RXFIFOSIZE in the USBHS_ENDPOINTX_FIFOSIZE register */
#define USBHS_ENDPOINTX_FIFOSIZE_Msk          _UINT8_(0xFF)                                        /* (USBHS_ENDPOINTX_FIFOSIZE) Register Mask  */


/* -------- USBHS_ENDPOINT0_CONFIGDATA : (USBHS Offset: 0x101F) ( R/ 8) ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected. -------- */
#define USBHS_ENDPOINT0_CONFIGDATA_RESETVALUE _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CONFIGDATA) ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected.  Reset Value */

#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits Position */
#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Selected UTMI+ DataWidth. Always 0 Indicates 8 Bits Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH(value) (USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_UTMIDATAWIDTH_Pos)) /* Assigment of value for UTMIDATAWIDTH in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Soft Connect Or Disconnect Position */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Soft Connect Or Disconnect Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE(value) (USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_SOFTCONE_Pos)) /* Assigment of value for SOFTCONE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Dynamic FIFO Sizing Is Selected Or Not Position */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Dynamic FIFO Sizing Is Selected Or Not Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING(value) (USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_DYNFIFOSIZING_Pos)) /* Assigment of value for DYNFIFOSIZING in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos  _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth TX ISO Endpoint Support Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth TX ISO Endpoint Support Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_HBTXE(value) (USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_HBTXE_Pos)) /* Assigment of value for HBTXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos  _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth RX ISO Endpoint Support Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates High Bandwidth RX ISO Endpoint Support Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_HBRXE(value) (USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_HBRXE_Pos)) /* Assigment of value for HBRXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Little Endian Ordering Position */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Indicates Little Endian Ordering Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN(value) (USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_BIGENDIAN_Pos)) /* Assigment of value for BIGENDIAN in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos  _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Packets Is Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Packets Is Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_MPTXE(value) (USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_MPTXE_Pos)) /* Assigment of value for MPTXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos  _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Amalgamation Is Selected Position */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Msk  (_UINT8_(0x1) << USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos) /* (USBHS_ENDPOINT0_CONFIGDATA) Automatic Splitting Of Bulk Amalgamation Is Selected Mask */
#define USBHS_ENDPOINT0_CONFIGDATA_MPRXE(value) (USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CONFIGDATA_MPRXE_Pos)) /* Assigment of value for MPRXE in the USBHS_ENDPOINT0_CONFIGDATA register */
#define USBHS_ENDPOINT0_CONFIGDATA_Msk        _UINT8_(0xFF)                                        /* (USBHS_ENDPOINT0_CONFIGDATA) Register Mask  */


/* -------- USBHS_FIFOX : (USBHS Offset: 0x1020) (R/W 32) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint -------- */
#define USBHS_FIFOX_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_FIFOX) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint  Reset Value */

#define USBHS_FIFOX_FIFOADDR_Pos              _UINT32_(0)                                          /* (USBHS_FIFOX) Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint Position */
#define USBHS_FIFOX_FIFOADDR_Msk              (_UINT32_(0xFFFFFFFF) << USBHS_FIFOX_FIFOADDR_Pos)   /* (USBHS_FIFOX) Writing To These Addresses Loads Data Into The TXFIFO For The Corresponding Endpoint Mask */
#define USBHS_FIFOX_FIFOADDR(value)           (USBHS_FIFOX_FIFOADDR_Msk & (_UINT32_(value) << USBHS_FIFOX_FIFOADDR_Pos)) /* Assigment of value for FIFOADDR in the USBHS_FIFOX register */
#define USBHS_FIFOX_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (USBHS_FIFOX) Register Mask  */


/* -------- USBHS_DEVCTL : (USBHS Offset: 0x1060) (R/W 8) Selects Whether The Core Is Operating In Peripheral Or Host Mode -------- */
#define USBHS_DEVCTL_RESETVALUE               _UINT8_(0x80)                                        /*  (USBHS_DEVCTL) Selects Whether The Core Is Operating In Peripheral Or Host Mode  Reset Value */

#define USBHS_DEVCTL_SESSION_Pos              _UINT8_(0)                                           /* (USBHS_DEVCTL) when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends Position */
#define USBHS_DEVCTL_SESSION_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_SESSION_Pos)           /* (USBHS_DEVCTL) when operating as an 'A' device, this bit is set or cleared by CPU to state or end a session. when operating as a 'B' device, this bit is set/cleared by the USBCORE when a session starts/ends Mask */
#define USBHS_DEVCTL_SESSION(value)           (USBHS_DEVCTL_SESSION_Msk & (_UINT8_(value) << USBHS_DEVCTL_SESSION_Pos)) /* Assigment of value for SESSION in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_HOSTREQ_Pos              _UINT8_(1)                                           /* (USBHS_DEVCTL) when set, the USBCORE will initiate the host negotiation when suspend mode is entered. Position */
#define USBHS_DEVCTL_HOSTREQ_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_HOSTREQ_Pos)           /* (USBHS_DEVCTL) when set, the USBCORE will initiate the host negotiation when suspend mode is entered. Mask */
#define USBHS_DEVCTL_HOSTREQ(value)           (USBHS_DEVCTL_HOSTREQ_Msk & (_UINT8_(value) << USBHS_DEVCTL_HOSTREQ_Pos)) /* Assigment of value for HOSTREQ in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_HOSTMODE_Pos             _UINT8_(2)                                           /* (USBHS_DEVCTL) this read-only bit is set when the USBCORE is acting as a host Position */
#define USBHS_DEVCTL_HOSTMODE_Msk             (_UINT8_(0x1) << USBHS_DEVCTL_HOSTMODE_Pos)          /* (USBHS_DEVCTL) this read-only bit is set when the USBCORE is acting as a host Mask */
#define USBHS_DEVCTL_HOSTMODE(value)          (USBHS_DEVCTL_HOSTMODE_Msk & (_UINT8_(value) << USBHS_DEVCTL_HOSTMODE_Pos)) /* Assigment of value for HOSTMODE in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_VBUS_Pos                 _UINT8_(3)                                           /* (USBHS_DEVCTL) encoded value for the VBus level Position */
#define USBHS_DEVCTL_VBUS_Msk                 (_UINT8_(0x3) << USBHS_DEVCTL_VBUS_Pos)              /* (USBHS_DEVCTL) encoded value for the VBus level Mask */
#define USBHS_DEVCTL_VBUS(value)              (USBHS_DEVCTL_VBUS_Msk & (_UINT8_(value) << USBHS_DEVCTL_VBUS_Pos)) /* Assigment of value for VBUS in the USBHS_DEVCTL register */
#define   USBHS_DEVCTL_VBUS_BSESSEND_Val      _UINT8_(0x0)                                         /* (USBHS_DEVCTL) Below SessionEnd  */
#define   USBHS_DEVCTL_VBUS_ASESSEND_Val      _UINT8_(0x1)                                         /* (USBHS_DEVCTL) Above SessionEnd, below AValid  */
#define   USBHS_DEVCTL_VBUS_AAVALID_Val       _UINT8_(0x2)                                         /* (USBHS_DEVCTL) Above AValid, below VBus Valid  */
#define   USBHS_DEVCTL_VBUS_AVBUSVALID_Val    _UINT8_(0x3)                                         /* (USBHS_DEVCTL) Above VBusValid  */
#define USBHS_DEVCTL_VBUS_BSESSEND            (USBHS_DEVCTL_VBUS_BSESSEND_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Below SessionEnd Position  */
#define USBHS_DEVCTL_VBUS_ASESSEND            (USBHS_DEVCTL_VBUS_ASESSEND_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above SessionEnd, below AValid Position  */
#define USBHS_DEVCTL_VBUS_AAVALID             (USBHS_DEVCTL_VBUS_AAVALID_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above AValid, below VBus Valid Position  */
#define USBHS_DEVCTL_VBUS_AVBUSVALID          (USBHS_DEVCTL_VBUS_AVBUSVALID_Val << USBHS_DEVCTL_VBUS_Pos) /* (USBHS_DEVCTL) Above VBusValid Position  */
#define USBHS_DEVCTL_LSDEV_Pos                _UINT8_(5)                                           /* (USBHS_DEVCTL) host mode only: this bit is set when a low speed device has been detected being connected to the port Position */
#define USBHS_DEVCTL_LSDEV_Msk                (_UINT8_(0x1) << USBHS_DEVCTL_LSDEV_Pos)             /* (USBHS_DEVCTL) host mode only: this bit is set when a low speed device has been detected being connected to the port Mask */
#define USBHS_DEVCTL_LSDEV(value)             (USBHS_DEVCTL_LSDEV_Msk & (_UINT8_(value) << USBHS_DEVCTL_LSDEV_Pos)) /* Assigment of value for LSDEV in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_FSDEV_Pos                _UINT8_(6)                                           /* (USBHS_DEVCTL) host mode only: this bit is set when a full or high speed device has been detected being connected to the port Position */
#define USBHS_DEVCTL_FSDEV_Msk                (_UINT8_(0x1) << USBHS_DEVCTL_FSDEV_Pos)             /* (USBHS_DEVCTL) host mode only: this bit is set when a full or high speed device has been detected being connected to the port Mask */
#define USBHS_DEVCTL_FSDEV(value)             (USBHS_DEVCTL_FSDEV_Msk & (_UINT8_(value) << USBHS_DEVCTL_FSDEV_Pos)) /* Assigment of value for FSDEV in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_BDEVICE_Pos              _UINT8_(7)                                           /* (USBHS_DEVCTL) indicates whether the core is operating as a 'A' device or 'B' device Position */
#define USBHS_DEVCTL_BDEVICE_Msk              (_UINT8_(0x1) << USBHS_DEVCTL_BDEVICE_Pos)           /* (USBHS_DEVCTL) indicates whether the core is operating as a 'A' device or 'B' device Mask */
#define USBHS_DEVCTL_BDEVICE(value)           (USBHS_DEVCTL_BDEVICE_Msk & (_UINT8_(value) << USBHS_DEVCTL_BDEVICE_Pos)) /* Assigment of value for BDEVICE in the USBHS_DEVCTL register */
#define USBHS_DEVCTL_Msk                      _UINT8_(0xFF)                                        /* (USBHS_DEVCTL) Register Mask  */


/* -------- USBHS_MISC : (USBHS Offset: 0x1061) (R/W 8) RX/TX Early DMA Enable Bits -------- */
#define USBHS_MISC_RESETVALUE                 _UINT8_(0x00)                                        /*  (USBHS_MISC) RX/TX Early DMA Enable Bits  Reset Value */

