jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/usbhs.h
/* -------- USBHS_LINKINFO : (USBHS Offset: 0x107A) (R/W 8) Allows Some Delays To Be Specified -------- */
#define USBHS_LINKINFO_RESETVALUE             _UINT8_(0x5C)                                        /*  (USBHS_LINKINFO) Allows Some Delays To Be Specified  Reset Value */

#define USBHS_LINKINFO_WTID_Pos               _UINT8_(0)                                           /* (USBHS_LINKINFO) sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms Position */
#define USBHS_LINKINFO_WTID_Msk               (_UINT8_(0xF) << USBHS_LINKINFO_WTID_Pos)            /* (USBHS_LINKINFO) sets the delay to be applied from idpullup being asserted to iddig being considered valid in units of 4.369ms Mask */
#define USBHS_LINKINFO_WTID(value)            (USBHS_LINKINFO_WTID_Msk & (_UINT8_(value) << USBHS_LINKINFO_WTID_Pos)) /* Assigment of value for WTID in the USBHS_LINKINFO register */
#define USBHS_LINKINFO_WTCON_Pos              _UINT8_(4)                                           /* (USBHS_LINKINFO) sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns Position */
#define USBHS_LINKINFO_WTCON_Msk              (_UINT8_(0xF) << USBHS_LINKINFO_WTCON_Pos)           /* (USBHS_LINKINFO) sets the wait to be applied to allow for the user's connect/disconnect filter in units of 533.3ns Mask */
#define USBHS_LINKINFO_WTCON(value)           (USBHS_LINKINFO_WTCON_Msk & (_UINT8_(value) << USBHS_LINKINFO_WTCON_Pos)) /* Assigment of value for WTCON in the USBHS_LINKINFO register */
#define USBHS_LINKINFO_Msk                    _UINT8_(0xFF)                                        /* (USBHS_LINKINFO) Register Mask  */


/* -------- USBHS_VPLEN : (USBHS Offset: 0x107B) (R/W 8) Sets The Duration Of The VBus Pulsing Charge -------- */
#define USBHS_VPLEN_RESETVALUE                _UINT8_(0x3C)                                        /*  (USBHS_VPLEN) Sets The Duration Of The VBus Pulsing Charge  Reset Value */

#define USBHS_VPLEN_VPLEN_Pos                 _UINT8_(0)                                           /* (USBHS_VPLEN) duration of VBus pulsing charge in units of 546.1us Position */
#define USBHS_VPLEN_VPLEN_Msk                 (_UINT8_(0xFF) << USBHS_VPLEN_VPLEN_Pos)             /* (USBHS_VPLEN) duration of VBus pulsing charge in units of 546.1us Mask */
#define USBHS_VPLEN_VPLEN(value)              (USBHS_VPLEN_VPLEN_Msk & (_UINT8_(value) << USBHS_VPLEN_VPLEN_Pos)) /* Assigment of value for VPLEN in the USBHS_VPLEN register */
#define USBHS_VPLEN_Msk                       _UINT8_(0xFF)                                        /* (USBHS_VPLEN) Register Mask  */


/* -------- USBHS_HSEOF1 : (USBHS Offset: 0x107C) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions -------- */
#define USBHS_HSEOF1_RESETVALUE               _UINT8_(0x80)                                        /*  (USBHS_HSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions  Reset Value */

#define USBHS_HSEOF1_HSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_HSEOF1) sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.) Position */
#define USBHS_HSEOF1_HSEOF1_Msk               (_UINT8_(0xFF) << USBHS_HSEOF1_HSEOF1_Pos)           /* (USBHS_HSEOF1) sets for high-speed transactions the time before eof to stop beginning new transactions, in units of 133.3ns. (the default setting corresponds to 17.07us.) Mask */
#define USBHS_HSEOF1_HSEOF1(value)            (USBHS_HSEOF1_HSEOF1_Msk & (_UINT8_(value) << USBHS_HSEOF1_HSEOF1_Pos)) /* Assigment of value for HSEOF1 in the USBHS_HSEOF1 register */
#define USBHS_HSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_HSEOF1) Register Mask  */


/* -------- USBHS_FSEOF1 : (USBHS Offset: 0x107D) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions -------- */
#define USBHS_FSEOF1_RESETVALUE               _UINT8_(0x77)                                        /*  (USBHS_FSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions  Reset Value */

#define USBHS_FSEOF1_FSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_FSEOF1) sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.) Position */
#define USBHS_FSEOF1_FSEOF1_Msk               (_UINT8_(0xFF) << USBHS_FSEOF1_FSEOF1_Pos)           /* (USBHS_FSEOF1) sets for full-speed transactions the time before eof to stop beginning new transactions, in units of 533.3ns. (the default setting corresponds to 63.46us.) Mask */
#define USBHS_FSEOF1_FSEOF1(value)            (USBHS_FSEOF1_FSEOF1_Msk & (_UINT8_(value) << USBHS_FSEOF1_FSEOF1_Pos)) /* Assigment of value for FSEOF1 in the USBHS_FSEOF1 register */
#define USBHS_FSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_FSEOF1) Register Mask  */


/* -------- USBHS_LSEOF1 : (USBHS Offset: 0x107E) (R/W 8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions -------- */
#define USBHS_LSEOF1_RESETVALUE               _UINT8_(0x72)                                        /*  (USBHS_LSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions  Reset Value */

#define USBHS_LSEOF1_LSEOF1_Pos               _UINT8_(0)                                           /* (USBHS_LSEOF1) sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.) Position */
#define USBHS_LSEOF1_LSEOF1_Msk               (_UINT8_(0xFF) << USBHS_LSEOF1_LSEOF1_Pos)           /* (USBHS_LSEOF1) sets for low-speed transactions the time before eof to stop beginning new transactions, in units of 1.067us. (the default setting corresponds to 121.6us.) Mask */
#define USBHS_LSEOF1_LSEOF1(value)            (USBHS_LSEOF1_LSEOF1_Msk & (_UINT8_(value) << USBHS_LSEOF1_LSEOF1_Pos)) /* Assigment of value for LSEOF1 in the USBHS_LSEOF1 register */
#define USBHS_LSEOF1_Msk                      _UINT8_(0xFF)                                        /* (USBHS_LSEOF1) Register Mask  */


/* -------- USBHS_SOFTRST : (USBHS Offset: 0x107F) (R/W 8) Assert Low The Output Reset Signals NRSTO and NRSTXO -------- */
#define USBHS_SOFTRST_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_SOFTRST) Assert Low The Output Reset Signals NRSTO and NRSTXO  Reset Value */

#define USBHS_SOFTRST_NRST_Pos                _UINT8_(0)                                           /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk. Position */
#define USBHS_SOFTRST_NRST_Msk                (_UINT8_(0x1) << USBHS_SOFTRST_NRST_Pos)             /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrsto will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrsto will be asynchronously asserted and synchronously de-asserted with respect to clk. Mask */
#define USBHS_SOFTRST_NRST(value)             (USBHS_SOFTRST_NRST_Msk & (_UINT8_(value) << USBHS_SOFTRST_NRST_Pos)) /* Assigment of value for NRST in the USBHS_SOFTRST register */
#define USBHS_SOFTRST_NRSTX_Pos               _UINT8_(1)                                           /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk. Position */
#define USBHS_SOFTRST_NRSTX_Msk               (_UINT8_(0x1) << USBHS_SOFTRST_NRSTX_Pos)            /* (USBHS_SOFTRST) when a 1 is written to this bit, the output nrstxo will be asserted (low) within a minimum delay of 7 cycles of the clk input. the output nrstxo will be asynchronously asserted and synchronously de-asserted with respect to xclk. Mask */
#define USBHS_SOFTRST_NRSTX(value)            (USBHS_SOFTRST_NRSTX_Msk & (_UINT8_(value) << USBHS_SOFTRST_NRSTX_Pos)) /* Assigment of value for NRSTX in the USBHS_SOFTRST register */
#define USBHS_SOFTRST_Msk                     _UINT8_(0x03)                                        /* (USBHS_SOFTRST) Register Mask  */


/* -------- USBHS_DMAINTR : (USBHS Offset: 0x1200) (R/W 32) DMA Interrupt Status for Each Channel -------- */
#define USBHS_DMAINTR_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_DMAINTR) DMA Interrupt Status for Each Channel  Reset Value */

#define USBHS_DMAINTR_DMAINTR_Pos             _UINT32_(0)                                          /* (USBHS_DMAINTR) DMA Interrupt for each channel Position */
#define USBHS_DMAINTR_DMAINTR_Msk             (_UINT32_(0xFF) << USBHS_DMAINTR_DMAINTR_Pos)        /* (USBHS_DMAINTR) DMA Interrupt for each channel Mask */
#define USBHS_DMAINTR_DMAINTR(value)          (USBHS_DMAINTR_DMAINTR_Msk & (_UINT32_(value) << USBHS_DMAINTR_DMAINTR_Pos)) /* Assigment of value for DMAINTR in the USBHS_DMAINTR register */
#define USBHS_DMAINTR_Msk                     _UINT32_(0x000000FF)                                 /* (USBHS_DMAINTR) Register Mask  */


/* -------- USBHS_RQPKTCOUNT : (USBHS Offset: 0x1304) (R/W 32) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer -------- */
#define USBHS_RQPKTCOUNT_RESETVALUE           _UINT32_(0x00)                                       /*  (USBHS_RQPKTCOUNT) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer  Reset Value */

