jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/usbhs.h
#define USBHS_PHY08_SQUELCH3_Pos              _UINT32_(0)                                          /* (USBHS_PHY08) MSB of Squelch configuration Position */
#define USBHS_PHY08_SQUELCH3_Msk              (_UINT32_(0x1) << USBHS_PHY08_SQUELCH3_Pos)          /* (USBHS_PHY08) MSB of Squelch configuration Mask */
#define USBHS_PHY08_SQUELCH3(value)           (USBHS_PHY08_SQUELCH3_Msk & (_UINT32_(value) << USBHS_PHY08_SQUELCH3_Pos)) /* Assigment of value for SQUELCH3 in the USBHS_PHY08 register */
#define USBHS_PHY08_RSVD0_Pos                 _UINT32_(1)                                          /* (USBHS_PHY08) Reserved Position */
#define USBHS_PHY08_RSVD0_Msk                 (_UINT32_(0x7F) << USBHS_PHY08_RSVD0_Pos)            /* (USBHS_PHY08) Reserved Mask */
#define USBHS_PHY08_RSVD0(value)              (USBHS_PHY08_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY08_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY08 register */
#define USBHS_PHY08_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY08) Register Mask  */

#define USBHS_PHY08_SQUELCH_Pos               _UINT32_(0)                                          /* (USBHS_PHY08 Position) MSB of Squelch configuration */
#define USBHS_PHY08_SQUELCH_Msk               (_UINT32_(0x1) << USBHS_PHY08_SQUELCH_Pos)           /* (USBHS_PHY08 Mask) SQUELCH */
#define USBHS_PHY08_SQUELCH(value)            (USBHS_PHY08_SQUELCH_Msk & (_UINT32_(value) << USBHS_PHY08_SQUELCH_Pos)) 

/* -------- USBHS_PHY0C : (USBHS Offset: 0x150C) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY0C_RESETVALUE                _UINT32_(0xE0)                                       /*  (USBHS_PHY0C) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY0C_RSVD0_Pos                 _UINT32_(0)                                          /* (USBHS_PHY0C) Reserved Position */
#define USBHS_PHY0C_RSVD0_Msk                 (_UINT32_(0x1F) << USBHS_PHY0C_RSVD0_Pos)            /* (USBHS_PHY0C) Reserved Mask */
#define USBHS_PHY0C_RSVD0(value)              (USBHS_PHY0C_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY0C_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY0C register */
#define USBHS_PHY0C_TUNE210_Pos               _UINT32_(5)                                          /* (USBHS_PHY0C) Lower 3 bits for HS amplitude tuning Position */
#define USBHS_PHY0C_TUNE210_Msk               (_UINT32_(0x7) << USBHS_PHY0C_TUNE210_Pos)           /* (USBHS_PHY0C) Lower 3 bits for HS amplitude tuning Mask */
#define USBHS_PHY0C_TUNE210(value)            (USBHS_PHY0C_TUNE210_Msk & (_UINT32_(value) << USBHS_PHY0C_TUNE210_Pos)) /* Assigment of value for TUNE210 in the USBHS_PHY0C register */
#define USBHS_PHY0C_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY0C) Register Mask  */


/* -------- USBHS_PHY10 : (USBHS Offset: 0x1510) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY10_RESETVALUE                _UINT32_(0xAA)                                       /*  (USBHS_PHY10) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY10_TUNE76543_Pos             _UINT32_(0)                                          /* (USBHS_PHY10) Upper 5 bits for HS amplitude tuning Position */
#define USBHS_PHY10_TUNE76543_Msk             (_UINT32_(0x1F) << USBHS_PHY10_TUNE76543_Pos)        /* (USBHS_PHY10) Upper 5 bits for HS amplitude tuning Mask */
#define USBHS_PHY10_TUNE76543(value)          (USBHS_PHY10_TUNE76543_Msk & (_UINT32_(value) << USBHS_PHY10_TUNE76543_Pos)) /* Assigment of value for TUNE76543 in the USBHS_PHY10 register */
#define USBHS_PHY10_DRVTUNE210_Pos            _UINT32_(5)                                          /* (USBHS_PHY10) Lower 3 bits for HS/FS/LS driver strength tuning Position */
#define USBHS_PHY10_DRVTUNE210_Msk            (_UINT32_(0x7) << USBHS_PHY10_DRVTUNE210_Pos)        /* (USBHS_PHY10) Lower 3 bits for HS/FS/LS driver strength tuning Mask */
#define USBHS_PHY10_DRVTUNE210(value)         (USBHS_PHY10_DRVTUNE210_Msk & (_UINT32_(value) << USBHS_PHY10_DRVTUNE210_Pos)) /* Assigment of value for DRVTUNE210 in the USBHS_PHY10 register */
#define USBHS_PHY10_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY10) Register Mask  */


/* -------- USBHS_PHY14 : (USBHS Offset: 0x1514) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY14_RESETVALUE                _UINT32_(0x12)                                       /*  (USBHS_PHY14) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY14_DRVTUNE43_Pos             _UINT32_(0)                                          /* (USBHS_PHY14) Upper 2 bits for HS/FS/LS driver strength tuning Position */
#define USBHS_PHY14_DRVTUNE43_Msk             (_UINT32_(0x3) << USBHS_PHY14_DRVTUNE43_Pos)         /* (USBHS_PHY14) Upper 2 bits for HS/FS/LS driver strength tuning Mask */
#define USBHS_PHY14_DRVTUNE43(value)          (USBHS_PHY14_DRVTUNE43_Msk & (_UINT32_(value) << USBHS_PHY14_DRVTUNE43_Pos)) /* Assigment of value for DRVTUNE43 in the USBHS_PHY14 register */
#define USBHS_PHY14_COMPBYPSS_Pos             _UINT32_(2)                                          /* (USBHS_PHY14) Auto compensation bypass Position */
#define USBHS_PHY14_COMPBYPSS_Msk             (_UINT32_(0x3) << USBHS_PHY14_COMPBYPSS_Pos)         /* (USBHS_PHY14) Auto compensation bypass Mask */
#define USBHS_PHY14_COMPBYPSS(value)          (USBHS_PHY14_COMPBYPSS_Msk & (_UINT32_(value) << USBHS_PHY14_COMPBYPSS_Pos)) /* Assigment of value for COMPBYPSS in the USBHS_PHY14 register */
#define USBHS_PHY14_BYPSSSQUELCH_Pos          _UINT32_(4)                                          /* (USBHS_PHY14) Bypass squelch trigger point configure in chirp mode Position */
#define USBHS_PHY14_BYPSSSQUELCH_Msk          (_UINT32_(0x1) << USBHS_PHY14_BYPSSSQUELCH_Pos)      /* (USBHS_PHY14) Bypass squelch trigger point configure in chirp mode Mask */
#define USBHS_PHY14_BYPSSSQUELCH(value)       (USBHS_PHY14_BYPSSSQUELCH_Msk & (_UINT32_(value) << USBHS_PHY14_BYPSSSQUELCH_Pos)) /* Assigment of value for BYPSSSQUELCH in the USBHS_PHY14 register */
#define USBHS_PHY14_ODT0_Pos                  _UINT32_(7)                                          /* (USBHS_PHY14) On die termination compensation voltage reference Position */
#define USBHS_PHY14_ODT0_Msk                  (_UINT32_(0x1) << USBHS_PHY14_ODT0_Pos)              /* (USBHS_PHY14) On die termination compensation voltage reference Mask */
#define USBHS_PHY14_ODT0(value)               (USBHS_PHY14_ODT0_Msk & (_UINT32_(value) << USBHS_PHY14_ODT0_Pos)) /* Assigment of value for ODT0 in the USBHS_PHY14 register */
#define USBHS_PHY14_Msk                       _UINT32_(0x0000009F)                                 /* (USBHS_PHY14) Register Mask  */

#define USBHS_PHY14_ODT_Pos                   _UINT32_(7)                                          /* (USBHS_PHY14 Position) On die termination compensation voltage reference */
#define USBHS_PHY14_ODT_Msk                   (_UINT32_(0x1) << USBHS_PHY14_ODT_Pos)               /* (USBHS_PHY14 Mask) ODT */
#define USBHS_PHY14_ODT(value)                (USBHS_PHY14_ODT_Msk & (_UINT32_(value) << USBHS_PHY14_ODT_Pos)) 

/* -------- USBHS_PHY18 : (USBHS Offset: 0x1518) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY18_RESETVALUE                _UINT32_(0x08)                                       /*  (USBHS_PHY18) USBHPHY Control Register.  Reset Value */

