jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/usbhs.h
#define USBHS_PHY28_HSDRIVST2_Pos             _UINT32_(0)                                          /* (USBHS_PHY28) MSB of HS transmit driver strength Position */
#define USBHS_PHY28_HSDRIVST2_Msk             (_UINT32_(0x1) << USBHS_PHY28_HSDRIVST2_Pos)         /* (USBHS_PHY28) MSB of HS transmit driver strength Mask */
#define USBHS_PHY28_HSDRIVST2(value)          (USBHS_PHY28_HSDRIVST2_Msk & (_UINT32_(value) << USBHS_PHY28_HSDRIVST2_Pos)) /* Assigment of value for HSDRIVST2 in the USBHS_PHY28 register */
#define USBHS_PHY28_DISCONDET_Pos             _UINT32_(1)                                          /* (USBHS_PHY28) HOST disconnects detection trigger point Position */
#define USBHS_PHY28_DISCONDET_Msk             (_UINT32_(0xF) << USBHS_PHY28_DISCONDET_Pos)         /* (USBHS_PHY28) HOST disconnects detection trigger point Mask */
#define USBHS_PHY28_DISCONDET(value)          (USBHS_PHY28_DISCONDET_Msk & (_UINT32_(value) << USBHS_PHY28_DISCONDET_Pos)) /* Assigment of value for DISCONDET in the USBHS_PHY28 register */
#define USBHS_PHY28_HSDRVCOMP_Pos             _UINT32_(5)                                          /* (USBHS_PHY28) HS drive current compensation voltage reference Position */
#define USBHS_PHY28_HSDRVCOMP_Msk             (_UINT32_(0x7) << USBHS_PHY28_HSDRVCOMP_Pos)         /* (USBHS_PHY28) HS drive current compensation voltage reference Mask */
#define USBHS_PHY28_HSDRVCOMP(value)          (USBHS_PHY28_HSDRVCOMP_Msk & (_UINT32_(value) << USBHS_PHY28_HSDRVCOMP_Pos)) /* Assigment of value for HSDRVCOMP in the USBHS_PHY28 register */
#define USBHS_PHY28_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY28) Register Mask  */

#define USBHS_PHY28_HSDRIVST_Pos              _UINT32_(0)                                          /* (USBHS_PHY28 Position) MSB of HS transmit driver strength */
#define USBHS_PHY28_HSDRIVST_Msk              (_UINT32_(0x1) << USBHS_PHY28_HSDRIVST_Pos)          /* (USBHS_PHY28 Mask) HSDRIVST */
#define USBHS_PHY28_HSDRIVST(value)           (USBHS_PHY28_HSDRIVST_Msk & (_UINT32_(value) << USBHS_PHY28_HSDRIVST_Pos)) 

/* -------- USBHS_PHY44 : (USBHS Offset: 0x1544) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY44_RESETVALUE                _UINT32_(0x40)                                       /*  (USBHS_PHY44) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY44_RSVD0_Pos                 _UINT32_(0)                                          /* (USBHS_PHY44) reserved Position */
#define USBHS_PHY44_RSVD0_Msk                 (_UINT32_(0x1) << USBHS_PHY44_RSVD0_Pos)             /* (USBHS_PHY44) reserved Mask */
#define USBHS_PHY44_RSVD0(value)              (USBHS_PHY44_RSVD0_Msk & (_UINT32_(value) << USBHS_PHY44_RSVD0_Pos)) /* Assigment of value for RSVD0 in the USBHS_PHY44 register */
#define USBHS_PHY44_PLLDAMP_Pos               _UINT32_(1)                                          /* (USBHS_PHY44) PLL damping factor Position */
#define USBHS_PHY44_PLLDAMP_Msk               (_UINT32_(0x1) << USBHS_PHY44_PLLDAMP_Pos)           /* (USBHS_PHY44) PLL damping factor Mask */
#define USBHS_PHY44_PLLDAMP(value)            (USBHS_PHY44_PLLDAMP_Msk & (_UINT32_(value) << USBHS_PHY44_PLLDAMP_Pos)) /* Assigment of value for PLLDAMP in the USBHS_PHY44 register */
#define USBHS_PHY44_DIGDBG_Pos                _UINT32_(2)                                          /* (USBHS_PHY44) Digital debug interface Position */
#define USBHS_PHY44_DIGDBG_Msk                (_UINT32_(0x1) << USBHS_PHY44_DIGDBG_Pos)            /* (USBHS_PHY44) Digital debug interface Mask */
#define USBHS_PHY44_DIGDBG(value)             (USBHS_PHY44_DIGDBG_Msk & (_UINT32_(value) << USBHS_PHY44_DIGDBG_Pos)) /* Assigment of value for DIGDBG in the USBHS_PHY44 register */
#define USBHS_PHY44_FRCVBUSVAL_Pos            _UINT32_(3)                                          /* (USBHS_PHY44) Force output vbus_valid Position */
#define USBHS_PHY44_FRCVBUSVAL_Msk            (_UINT32_(0x1) << USBHS_PHY44_FRCVBUSVAL_Pos)        /* (USBHS_PHY44) Force output vbus_valid Mask */
#define USBHS_PHY44_FRCVBUSVAL(value)         (USBHS_PHY44_FRCVBUSVAL_Msk & (_UINT32_(value) << USBHS_PHY44_FRCVBUSVAL_Pos)) /* Assigment of value for FRCVBUSVAL in the USBHS_PHY44 register */
#define USBHS_PHY44_RSVD1_Pos                 _UINT32_(4)                                          /* (USBHS_PHY44) reserved Position */
#define USBHS_PHY44_RSVD1_Msk                 (_UINT32_(0x7) << USBHS_PHY44_RSVD1_Pos)             /* (USBHS_PHY44) reserved Mask */
#define USBHS_PHY44_RSVD1(value)              (USBHS_PHY44_RSVD1_Msk & (_UINT32_(value) << USBHS_PHY44_RSVD1_Pos)) /* Assigment of value for RSVD1 in the USBHS_PHY44 register */
#define USBHS_PHY44_FRCSESSEND_Pos            _UINT32_(7)                                          /* (USBHS_PHY44) force session end Position */
#define USBHS_PHY44_FRCSESSEND_Msk            (_UINT32_(0x1) << USBHS_PHY44_FRCSESSEND_Pos)        /* (USBHS_PHY44) force session end Mask */
#define USBHS_PHY44_FRCSESSEND(value)         (USBHS_PHY44_FRCSESSEND_Msk & (_UINT32_(value) << USBHS_PHY44_FRCSESSEND_Pos)) /* Assigment of value for FRCSESSEND in the USBHS_PHY44 register */
#define USBHS_PHY44_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY44) Register Mask  */

#define USBHS_PHY44_RSVD_Pos                  _UINT32_(0)                                          /* (USBHS_PHY44 Position) reserved */
#define USBHS_PHY44_RSVD_Msk                  (_UINT32_(0x1) << USBHS_PHY44_RSVD_Pos)              /* (USBHS_PHY44 Mask) RSVD */
#define USBHS_PHY44_RSVD(value)               (USBHS_PHY44_RSVD_Msk & (_UINT32_(value) << USBHS_PHY44_RSVD_Pos)) 

/* -------- USBHS_PHY48 : (USBHS Offset: 0x1548) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY48_RESETVALUE                _UINT32_(0x04)                                       /*  (USBHS_PHY48) USBHPHY Control Register.  Reset Value */

